{
    "intents": [
      {
        "tag": "loas",
        "patterns": [
          "loa loa loa",
          "Loa Loa Loa",
          "Dime una loa"
        ],
        "responses": [
          "Bailando con la más guapa me fui a dar un traguito, cuando regresé a buscarla ¡se había ido con mi amiguito!",
          "Me dijeron que me case pero eso es un problema, ¿pa' qué quiero una esposa si la chupa es mi condena?",
          "La fritada bien tostadita caliente la he de comer así mismito está mi guambra ¡esperando en el taller!",
          "Mi suegra es como el diablo nadie la puede aguantar pero si le doy dos tragos ¡hasta conmigo quiere bailar!",
          "A mi guambra le prometo serle siempre muy leal pero si hay buen aguardiente ¡hasta la suegra se va a gozar!",
          "Ahora que eres adulto, te crees muy importante, pero mírate bien al espejo, sigues siendo ignorante",
          "Este joven con su moto, y su casco brillante, no sabe que su chica, lo engaña con su amante",
          "Cuando eras jovencito, soñabas con aventuras, ahora que eres mayor, sólo piensas en calenturas",
          "Este señor tan serio, con su ceño fruncido, no sabe que en su barrio, le llaman el aburrido",
          "Esa panzota que llevas, parece más de una ballena, deja ya de comer tanto, que pareces una morcilla rellena",
          "Con esa cara de suegro, y esa calva reluciente, pareces más un huevo, que alguien decente",
          "Con esos pantalones, apretados y rotos, pareces más un payaso, de algún circo loco",
          "Esa doñita tan seria, con su cara de limón, ni se imagina la gente, que ronca como un camión",
          "Con esa camisa a rayas, y esos zapatos de charol, pareces más un bandido, de una película de acción",
          "Con esa barba mal hecha, y ese corte de pelo, pareces más un mendigo, que alguien del pueblo",
          "Cuando eras más pequeño, soñabas con la riqueza, ahora que eres mayor, vives en la pobreza",
          ""
        ]
      },
      {
        "tag": "actividades",
        "patterns": [
          "actividades",
          "¿Qué puedo hacer?",
          "¿Qué actividades puedo hacer?",
          "Actividades al aire libre por hacer"
        ],
        "responses": [
          "En Latacunga puedes visitar el Parque Nacional Cotopaxi",
          "En Latacunga puedes visitar la Iglesia de la Merced",
          "En Latacunga puedes visitar el Museo Casa de los Marqueses",
          "Puedes hacer senderismo en el Parque Nacional Cotopaxi",
          "Puedes disfrutar de un paseo en bicicleta por la ciudad"
        ]
      },
      {
        "tag": "festividades",
        "patterns": [
          "festividades",
          "¿Qué festivales hay?",
          "¿Qué eventos culturales hay?",
          "¿Qué se festeja normalmente?"
        ],
        "responses": [
          "Puedes disfrutar de la Fiesta de la Mama Negra, un festival tradicional lleno de color y cultura",
          "Latacunga tiene una rica agenda cultural con eventos y actividades durante todo el año",
          "En Latacunga también se celebra el Carnaval, con desfiles y comparsas llenas de alegría y color",
          "El Pase del Niño es otra festividad importante, con procesiones y eventos religiosos",
          "Durante la Semana Santa, hay diversas actividades religiosas y culturales en la ciudad"
        ]
      },
      {
        "tag": "comida",
        "patterns": [
          "comida",
          "¿Dónde puedo comer?",
          "Recomiéndame un lugar para comer",
          "¿Dime buenos restaurantes?"
        ],
        "responses": [
          "En el Rincón de la tía Ly Latacunga, entre las calles Padre Salcedo y 2 de Mayo, puedes disfrutar de deliciosos platos típicos.", 
          "En Los Exquisitos Hornados de Riobamba, ubicado entre las calles 2 de Mayo y Guayaquil, los hornados son deliciosos.",
          "En la cafeteria El Gringo y la Gorda, ubicado en la calle Padre Salcedo, puedes disfrutar de un delicioso café",
          "En El Pasaje ubicado en la calle Padre Salcedo, puedes disfrutar de una deliciosa comida rápida",
          "En las Allullas La Estación ubicado en la avenida Marco Aurelio Subía, puedes disfrutar de deliciosas allullas",
          "En las Chugchucaras Don Pancho ECUATORIANISIMAS, ubicado en la calle Quijano y Ordóñez, puedes disfrutar de deliciosas chugchucaras",
          "En la La Mama Negra Chugchucaras A Leña, ubicado en la calle Quijano y Ordóñez, puedes disfrutar de deliciosas chugchucaras a leña"
        ]
      },
      {
        "tag": "hospedaje",
        "patterns": [
          "hospedaje",
          "¿Dónde puedo hospedarme?",
          "Recomiéndame un lugar para hospedarme",
          "Dime buenos hoteles"
        ],
        "responses": [
          [
            "Hay varios hoteles y hostales donde puedes hospedarte, desde opciones económicas hasta más lujosas.",
            "Puedes hospedarte en el Hotel Rodelu, ubicado en la calle Quijano y Ordóñez.",
            "El Hotel Endamo, ubicado en la calle Sánchez de Orellana, ofrece cómodas habitaciones.",
            "El Hotel Cotopaxi, ubicado en la avenida Marco Aurelio Subía, es una opción lujosa.",
            "El Hostal Tiana, ubicado en la calle Quijano y Ordóñez, es una opción económica y acogedora.",
            "El Gran Hotel Rex, ubicado en la calle Belisario Quevedo, es una opción céntrica y cómoda."
          ]
        ]
      },
      {
        "tag": "mercados",
        "patterns": [
          "mercados",
          "¿Qué mercados puedo visitar en Latacunga?",
          "Recomiéndame un mercado en Latacunga",
          "Dime buenos mercados en Latacunga"
        ],
        "responses": [
          [
            "Puedes visitar el Mercado Cerrado y el Mercado Mayorista para comprar productos frescos y artesanías",
            "El Mercado Mayorista ofrece una amplia gama de productos frescos y artesanías",
            "El Mercado Cerrado es conocido por su variedad de productos locales",
            "El Mercado La Merced es famoso por sus productos agrícolas y artesanales",
            "El Mercado El Salto es ideal para encontrar productos frescos y locales"
          ]
        ]
      },
     {
      "tag": "universidades",
      "patterns": [
        "universidades",
        "¿Qué universidades existen?",
        "Mencióname algunas universidades",
        "¿Cuáles son las opciones universitarias?",
        "Quiero estudiar una carrera universitaria",
        "Opciones de educación superior",
        "¿Dónde puedo estudiar una carrera?",
        "Dime universidades disponibles"
      ],
      "responses": [
        [
          "En Latacunga puedes encontrar varias universidades como la Universidad Técnica de Cotopaxi (UTC), que ofrece diversas carreras y programas académicos.",
          "También está la Universidad de las Fuerzas Armadas ESPE, que cuenta con una sede en Latacunga y diversas opciones de estudio.",
          "Otra opción es la Universidad Técnica Particular de Loja (UTPL), que ofrece educación presencial y a distancia.",
          "La Pontificia Universidad Católica del Ecuador (PUCE) también tiene una sede en Latacunga con programas académicos variados.",
          "Cada universidad tiene su propia oferta académica y modalidades de estudio, por lo que puedes consultar sus páginas web para más información.",
          "Si buscas una universidad, te recomiendo revisar los programas y requisitos de cada institución para elegir la que mejor se adapte a tus intereses."
        ]
      ]
    },
    {
      "tag": "escuelas",
      "patterns": [
        "escuelas",
        "¿Qué escuelas existen?",
        "Mencióname algunas escuelas",
        "¿Cuáles son las opciones escolares?",
        "Quiero inscribir a mi hijo en una escuela",
        "Opciones de educación primaria",
        "¿Dónde puedo encontrar una escuela?",
        "Dime escuelas disponibles"
      ],
      "responses": [
        [
          "Claro, en Latacunga hay varias escuelas donde puedes inscribir a tu hijo. Algunas opciones son la Escuela de 11 de Noviembre (Illinchisi), la Escuela de Alaques (Alaquez) y la Escuela de Belisario Quevedo (Guanailin).",
          "Mira, si estás buscando escuelas en Latacunga, podrías considerar la Escuela de Eloy Alfaro en San Felipe o la Escuela de Guaitacama en Guaytacama. También está la Escuela de Ignacio Flores en Parque Flores.",
          "Te cuento que hay varias opciones dependiendo de la zona en la que estés. Algunas recomendadas son la Escuela de Joseguango Bajo, la Escuela de Juan Montalvo en San Sebastián y la Escuela de La Matriz.",
          "Si buscas más alternativas, puedes revisar la Escuela de Mulaló, la Escuela de Poaló, la Escuela de San Buenaventura o la Escuela de San Juan de Pastocalle.",
          "También tienes la Escuela de Tanicuchi y la Escuela de Toacaso, que son buenas opciones dependiendo de la ubicación que prefieras.",
          "Cada escuela tiene su propio enfoque y metodología. Te recomendaría visitar sus instalaciones o hablar con otros padres para ver cuál se adapta mejor a lo que buscas para tu hijo."
        ]
      ]
    },
    {
      "tag": "institutos",
      "patterns": [
        "institutos",
        "¿Qué institutos existen?",
        "Mencióname algunos institutos",
        "¿Cuáles son las opciones de educación tecnológica?",
        "Quiero estudiar en un instituto",
        "Opciones de educación superior técnica",
        "¿Dónde puedo encontrar un instituto?",
        "Dime institutos disponibles"
      ],
      "responses": [
        [
          "Mira, en Latacunga hay algunos institutos si estás buscando educación técnica. Uno de ellos es el Instituto Tecnológico Ramón Barba Naranjo, que tiene varias opciones de estudio.",
          "Si quieres estudiar en un instituto en Latacunga, puedes revisar el Instituto Superior Tecnológico Vicente León. Tiene programas interesantes que podrían ajustarse a lo que buscas.",
          "También está el Instituto Superior Universitario Cotopaxi, que ofrece carreras técnicas y tecnológicas. Vale la pena echarle un vistazo.",
          "Todo depende de lo que quieras estudiar, pero cualquiera de estos institutos puede ser una buena opción. Te recomendaría revisar su oferta académica y ver cuál te conviene más.",
          "Cada instituto tiene su propio enfoque y áreas de especialización, así que lo mejor es que los contactes o visites para obtener más información.",
          "Así que si buscas una educación técnica en Latacunga, definitivamente considera el Instituto Tecnológico Ramón Barba Naranjo, el Instituto Superior Tecnológico Vicente León, Instituto Superior Tecnológico Victoria Vásconez Cuvi y el Instituto Superior Universitario Cotopaxi. Todos ellos son excelentes alternativas para formarte en una carrera con futuro."
        ]
      ]
    },
    {
      "tag": "platos_tipicos",
      "patterns": [
        "platos típicos",
        "¿Cuáles son los platos tradicionales?",
        "Quiero conocer la gastronomía local",
        "¿Qué platos debo probar en Latacunga?",
        "Cuéntame sobre la comida típica",
        "¿Qué especialidades tiene la región?",
        "Dame ejemplos de platos locales",
        "¿Cuáles son los sabores característicos de Latacunga?"
      ],
      "responses": [
        [
          "En Latacunga hay una variedad de platos típicos que definitivamente debes probar. Por ejemplo, las allullas, que son panecillos crujientes hechos con harina de trigo y manteca de chancho. ¡Son deliciosos!",
          "Otro plato destacado son las chugchucaras, que incluyen carne de cerdo frita, tostado, mote, papas, plátanos fritos, empanadas dulces y canguil. Es un plato muy completo y sabroso.",
          "No puedes dejar de probar el caldo de pata, un caldo reconfortante hecho con patas de res, mote, papas, cebolla, ajo y especias. Es perfecto para calentar el alma.",
          "Las empanadas de morocho son otro clásico. Están hechas con maíz morocho y se pueden rellenar con queso, pollo o carne. Se fríen hasta dorarse y son un excelente acompañamiento.",
          "La fritada es otro plato muy popular en la zona. Se trata de carne de cerdo frita que se sirve con mote, papas, plátanos maduros y curtido de cebolla. Ideal para compartir en familia.",
          "Y no olvides los caramelos artesanales, que son dulces elaborados por artesanos de la ciudad. Son perfectos para satisfacer tu antojo de algo dulce después de una comida."
        ]
      ]
    },
    {
      "tag": "transporte_publico_utcmatriz",
      "patterns": [
        "¿Qué buses me llevan a la UTC Matriz?",
        "¿Cuáles son las opciones de transporte público para llegar a la UTC?",
        "¿Dónde me dejan los buses Citibus y Sultana de Cotopaxi si voy a la UTC?",
        "¿Qué diferencia hay entre los buses Citibus y Sultana de Cotopaxi?",
        "Si tomo un bus Citibus, ¿dónde debo bajarme para ir a la UTC?",
        "¿Cuál es el bus que me deja más cerca de la entrada de la UTC Matriz?"
      ],
      "responses": [
        "Puedes llegar a la UTC Matriz en transporte público usando los buses Citibus o Sultana de Cotopaxi.",
        "Los buses Citibus te dejan una calle abajo de la UTC Matriz, por lo que debes caminar unos metros hasta la entrada.",
        "Si tomas un bus Sultana de Cotopaxi, te dejará justo al frente de la UTC Matriz.",
        "La diferencia entre los buses Citibus y Sultana de Cotopaxi es que los primeros te dejan una calle abajo y los segundos justo en la entrada de la universidad.",
        "Si quieres bajarte lo más cerca posible de la UTC Matriz, te recomendamos tomar los buses Sultana de Cotopaxi.",
        "Para llegar en bus a la UTC Matriz, puedes elegir entre Citibus o Sultana de Cotopaxi, dependiendo de qué tan cerca quieras bajarte de la entrada."
      ]
    },
    {
      "tag": "transporte_publico_salto",
      "patterns": [
        "¿Qué buses pasan por El Salto?",
        "¿Cómo puedo llegar a El Salto en transporte público?",
        "¿Dónde me dejan los buses Citibus y Sultana de Cotopaxi en El Salto?",
        "¿Cuál es la mejor opción de bus para ir al mercado de ropa de El Salto?",
        "Si voy en bus a El Salto, ¿por qué calle debo bajarme?",
        "¿Qué diferencia hay entre los buses Citibus y Sultana de Cotopaxi en esta ruta?"
      ],
      "responses": [
        "Para llegar a El Salto en transporte público, puedes tomar los buses Citibus o Sultana de Cotopaxi.",
        "Ambos buses, Citibus y Sultana de Cotopaxi, te dejan en la calle a la derecha del mercado de ropa de El Salto.",
        "Si viajas a El Salto en bus, debes bajarte en la calle lateral derecha del mercado de ropa.",
        "No hay diferencia en la parada entre los buses Citibus y Sultana de Cotopaxi en El Salto, ambos te dejan en la misma calle.",
        "Para visitar el mercado de ropa de El Salto, puedes usar los buses Citibus o Sultana de Cotopaxi, que te dejarán muy cerca.",
        "Si buscas transporte público hacia El Salto, los buses Citibus y Sultana de Cotopaxi son la mejor opción."
      ]
    },
    {
      "tag": "transporte_publico_fae",
      "patterns": [
        "¿Qué buses pasan por la FAE?",
        "¿Cómo puedo llegar a la FAE en transporte público?",
        "¿Cuáles son las opciones de buses si estoy en El Salto y quiero ir a la FAE?",
        "¿Qué buses puedo tomar desde el terminal terrestre para ir a la FAE?",
        "¿Cuál es la mejor opción de bus para llegar a la FAE desde diferentes puntos?",
        "Si estoy en El Salto, ¿qué bus me conviene tomar para ir a la FAE?"
      ],
      "responses": [
        "Para llegar a la FAE en transporte público, puedes tomar los buses Citibus o Sultana de Cotopaxi.",
        "Si te encuentras en El Salto, la mejor opción para ir a la FAE es tomar los buses Citibus o Sultana de Cotopaxi.",
        "Desde el terminal terrestre, puedes tomar los buses Mulaló o Aláquez, que también pasan por la FAE.",
        "Si necesitas llegar a la FAE desde el terminal, los buses Mulaló y Aláquez son una buena opción.",
        "Desde El Salto, los buses Citibus y Sultana de Cotopaxi te llevarán a la FAE de manera más rápida.",
        "Dependiendo de tu ubicación, puedes tomar diferentes buses para llegar a la FAE: Citibus y Sultana de Cotopaxi desde El Salto, o Mulaló y Aláquez desde el terminal terrestre."
      ]
    },
    {
      "tag": "transporte_publico_lalaguna",
      "patterns": [
        "¿Qué líneas de buses llegan hasta La Laguna?",
        "¿Cómo puedo trasladarme a La Laguna en bus?",
        "¿Cuáles son las opciones de transporte público para ir a La Laguna?",
        "Si estoy en El Salto, ¿qué transporte debo tomar para llegar a La Laguna?",
        "¿Los buses Citibus y Sultana de Cotopaxi tienen paradas en La Laguna?",
        "¿Cuál es la mejor alternativa de bus para ir a La Laguna?"
      ],
      "responses": [
        "Para llegar a La Laguna en transporte público, puedes tomar los buses Citibus o Sultana de Cotopaxi.",
        "Las líneas de transporte que llegan a La Laguna son Citibus y Sultana de Cotopaxi.",
        "Si necesitas trasladarte a La Laguna, los buses disponibles son Citibus y Sultana de Cotopaxi.",
        "Desde El Salto, puedes tomar un bus Citibus o Sultana de Cotopaxi para llegar a La Laguna.",
        "Sí, los buses Citibus y Sultana de Cotopaxi tienen paradas en La Laguna.",
        "La mejor alternativa de transporte público para ir a La Laguna es tomar un bus Citibus o Sultana de Cotopaxi."
      ]
    },
    {
      "tag": "hospitales",
      "patterns": [
        "¿Cuáles son los hospitales en Latacunga?",
        "¿Dónde queda el Hospital del IESS en Latacunga?",
        "¿Qué servicios ofrece el Hospital Básico San Francisco?",
        "¿Dónde se encuentra el Hospital Cotopaxi?",
        "¿El Hospital Roosevelt es público o privado?",
        "¿Cómo llegar al Hospital General Latacunga?",
        "¿El Hospital Básico Clínica Santa Cecilia atiende emergencias?",
        "¿Qué especialidades tiene el Hospital Básico SNE-MED?"
      ],
      "responses": [
        "Los hospitales en Latacunga incluyen: Hospital del IESS, Hospital Básico San Francisco, Hospital Cotopaxi, Hospital Roosevelt, Hospital General Latacunga, Hospital Básico Clínica Santa Cecilia y Hospital Básico SNE-MED.",
        "El Hospital del IESS (Seguro Social) está ubicado en Latacunga y brinda atención a afiliados y jubilados.",
        "El HOSPITAL LA MERCED ofrece consultas generales, especialidades médicas y servicios de emergencia.",
        "El Hospital Cotopaxi se encuentra en Latacunga y es una referencia en atención médica especializada.",
        "El Hospital Roosevelt es un hospital privado que brinda atención médica en diversas especialidades.",
        "Para llegar al Hospital General Latacunga, puedes utilizar transporte público o vehículo particular, ubicado en una zona accesible de la ciudad.",
        "El Hospital Básico Clínica Santa Cecilia cuenta con atención en emergencias y diferentes especialidades médicas.",
        "El Hospital Básico SNE-MED ofrece consultas generales, especialidades médicas y servicios hospitalarios básicos."
      ]
    },
    {
      "tag": "clinicas",
      "patterns": [
        "¿Cuáles son las clínicas más conocidas en Latacunga?",
        "¿Dónde está ubicada la Clínica Latacunga?",
        "¿Qué tipo de procedimientos realiza la Clínica Cirugía Control?",
        "¿Qué servicios ofrece la Clínica NovaSalud?",
        "¿El Hospital Básico San Francisco tiene servicios de clínica?",
        "¿Qué tipo de cirugía se realiza en la Clínica de Bypass Gástrico en Latacunga?",
        "¿En qué se especializa la Clínica Cirugía Control?",
        "¿Qué tratamientos realiza la Clínica de Manga Gástrica?"
      ],
      "responses": [
        "En Latacunga, algunas de las clínicas más conocidas son: Clínica Latacunga, Clínica Cirugía Control, Clínica de Bypass Gástrico, Clínica NovaSalud, y el Hospital Básico San Francisco.",
        "La Clínica Latacunga está ubicada en el centro de la ciudad, ofreciendo una amplia gama de servicios médicos.",
        "La Clínica Cirugía Control se especializa en procedimientos como coloproctología, bypass gástrico, manga gástrica, y balón gástrico.",
        "La Clínica NovaSalud ofrece atención médica en varias especialidades, como medicina general, cirugía y otras consultas especializadas.",
        "Sí, el Hospital Básico San Francisco también ofrece servicios de clínica, incluyendo consultas externas y hospitalización.",
        "En la Clínica de Bypass Gástrico en Latacunga se realizan procedimientos quirúrgicos para la pérdida de peso, como bypass gástrico y manga gástrica.",
        "La Clínica Cirugía Control está especializada en cirugía digestiva, tratamiento de enfermedades del colon y cirugía bariátrica.",
        "La Clínica de Manga Gástrica en Latacunga ofrece procedimientos quirúrgicos para la reducción de peso, como la manga gástrica."
      ]
    },
      {
        "tag": "actividades_deportivas",
        "patterns": [
          "¿Qué deportes puedo practicar en Latacunga?", "¿Hay actividades deportivas en la ciudad?", "Recomiéndame deportes al aire libre aquí", "¿Dónde hacer ejercicio en Latacunga?", "¿Hay lugares para correr o andar en bici?",
          "¿Existen ligas locales de algún deporte?", "¿Organizan eventos deportivos?", "¿Hay clubes deportivos para unirse?", "¿Deportes extremos cerca de Latacunga?", "¿Puedo escalar montañas aquí?"
        ],
        "responses": [
          "¡Claro! En Latacunga puedes practicar senderismo en el Cotopaxi, ciclismo en el Parque Nacional, o incluso unirte a los torneos de fútbol los fines de semana.  ¿Te gustaría saber más sobre alguna actividad en específico?",
          "¿Te animas por el aire libre? Te recomiendo el trail running en el Rumiñahui o el kayak en la laguna de Limpiopungo. ¡Hay opciones para todos los niveles! ",
          "¡Sí! Prueba el voleibol playa en La Victoria o el parapente cerca del volcán. ¿Quieres que te cuente más detalles de alguno?",
          "En la ciudad hay grupos de running que se reúnen en el Parque Vicente León. También puedes alquilar bicicletas cerca del centro.  ¿Necesitas direcciones?",
          "¿Sabías que el Parque Nacional Cotopaxi es ideal para cabalgatas? Además, hay rutas seguras para ciclistas. ¡La aventura está a un paso! "
        ]
      },
      {
        "tag": "fechas_importantes",
        "patterns": [
          "¿Cuáles son las fechas importantes de Latacunga?", "¿Qué celebraciones hay este mes?", "Festividades clave de la ciudad", "¿Cuándo es la Fiesta de la Mama Negra?", "¿En qué fecha se fundó Latacunga?",
          "¿Hay feriados locales próximos?", "¿Qué festejos tradicionales no debo perderme?", "¿Cuándo es el Carnaval aquí?", "¿Alguna fiesta histórica?", "¿Eventos culturales este año?"
        ],
        "responses": [
          "¡Apúntate estas fechas!  La Mama Negra se celebra en noviembre, la fundación de la ciudad es el 27 de septiembre, y el Carnaval se vive con agua y harina en febrero. ¿Quieres que profundice en alguna?",
          "No te pierdas el 11 de noviembre: es el día central de la Mama Negra, con desfiles llenos de color y tradición.  ¿Te interesa saber el significado de esta fiesta?",
          "El 27 de septiembre es clave: se conmemora la fundación de Latacunga. Además, en junio se celebra el Inti Raymi. ¡Cada mes tiene algo especial! ",
          "En diciembre está el Pase del Niño Viajero, una procesión única con música y danzas. ¡Es una experiencia cultural imperdible! ",
          "¿Eres fan de las leyendas? Durante el Día de los Difuntos (2 de noviembre), se cuenta la historia de la «Caja Ronca» en el cementerio local. 🕯 ¿Te atreverías a ir?"
        ]
      },
      {
        "tag": "historia_mamanegra",
        "patterns": [
          "¿Qué representa la Mama Negra?", "Historia de la Mama Negra", "¿Por qué es importante esta tradición?", "¿Quién creó la Mama Negra?", "¿Cuál es el origen de la fiesta?",
          "¿Qué simbolizan los personajes de la Mama Negra?", "¿Es una tradición indígena o española?", "¿Cómo ha evolucionado esta celebración?", "¿Hay leyendas alrededor de la Mama Negra?", "¿Por qué se llama así?"
        ],
        "responses": [
          "¡Es una fusión cultural!  La Mama Negra honra a la Virgen de La Merced y mezcla elementos africanos, indígenas y mestizos. Se dice que nació para proteger a la ciudad de erupciones volcánicas. ¿Quieres saber más sobre sus personajes?",
          "Imagina esto: en el siglo XVIII, los esclavos africanos introdujeron ritmos y danzas, mientras los indígenas agregaron símbolos agrícolas. ¡Hoy es Patrimonio Cultural del Ecuador! ",
          "¿Sabías que hay dos versiones? La «Mama Negra» de septiembre (religiosa) y la de noviembre (popular). Ambas son un espectáculo de música y máscaras. ",
          "El personaje principal lleva un vestido colorido y un muñeco simbolizando la dualidad vida/muerte. ¡Cada detalle tiene un significado profundo! ",
          "Una leyenda cuenta que la Mama Negra calmó la furia del Cotopaxi en 1742. Desde entonces, se la considera protectora de Latacunga.  ¿Impresionante, verdad?"
        ]
      },
      {
        "tag": "historia_latacunga",
        "patterns": [
          "¿Cómo se fundó Latacunga?", "Datos históricos de la ciudad", "¿Qué origen tiene Latacunga?", "¿Quién fundó Latacunga?", "¿Cuál es la historia antigua de la ciudad?",
          "¿Qué civilizaciones habitaron aquí antes?", "¿Cómo afectaron los volcanes a su historia?", "¿Latacunga fue parte del Imperio Inca?", "¿Hay ruinas arqueológicas cerca?", "¿Qué batallas ocurrieron aquí?"
        ],
        "responses": [
          "¡Viajemos al pasado!  Latacunga fue fundada en 1534 por los españoles, pero antes fue un asentamiento de los Panzaleos. Su nombre en quichua significa «tierra estrecha». ¿Quieres saber sobre su rol en la colonia?",
          "¿Sabías que la ciudad fue destruida 3 veces por el Cotopaxi?  La última erupción grave fue en 1877. ¡Por eso sus edificios son de piedra volcánica!",
          "En la época inca, Latacunga era un «tambo» (lugar de descanso) en la ruta Quito-Cusco. Hoy aún se ven vestigios de caminos empedrados. ",
          "Durante la independencia, fue clave en la batalla de Tapi (1822). ¡Hasta Simón Bolívar pasó por aquí! ¿Te interesan sus monumentos históricos?",
          "La Catedral de Latacunga tiene una campana fundida con oro de Minas Gerona.  ¿Quieres que te recomiende un tour guiado por el centro histórico?"
        ]
      },
      {
        "tag": "ubicacion_latacunga",
        "patterns": [
          "¿Dónde está Latacunga?", "Ubicación geográfica de la ciudad", "¿En qué provincia está?", "¿Latacunga queda cerca de Quito?", "¿Cómo llegar desde Guayaquil?",
          "¿Qué altura tiene Latacunga?", "¿Latacunga está en la Sierra?", "¿Cuál es la dirección exacta del centro?", "¿Hay mapas detallados de la ciudad?", "¿Qué límites naturales tiene?"
        ],
        "responses": [
          "Latacunga es la capital de Cotopaxi, a 2,800 msnm. Está en la Panamericana Sur, a 1h30 de Quito. ¡Rodeada por el Cotopaxi, Quilotoa y el Rumiñahui!",
          "Si vienes desde Quito, toma la E35 hacia el sur (89 km). Desde Guayaquil, son 4h por la vía Milagro-Quevedo. ¿Necesitas recomendaciones de transporte? ",
          "¿Sabías que la ciudad está en el valle del río Cutuchi?  Su clima es fresco (10-20°C). Ideal para disfrutar sin tanto calor. ¿Buscas alojamiento?",
          "Coordenadas exactas: 0°55′S 78°36′O. ¡Pero no te preocupes! Todos los buses interprovinciales paran en la Terminal Terrestre. ",
          "Limita al norte con Quito, al sur con Ambato, y al este con la Amazonía. ¡Es el corazón de Ecuador! ¿Planeas visitar otros lugares cercanos?"
        ]
      },
      {
        "tag": "ubicacion_parque_nacional_cotopaxi",
        "patterns": [
          "¿Cómo llegar al Parque Nacional Cotopaxi?", "¿Dónde queda el Cotopaxi?", "Ubicación del parque Cotopaxi", "¿Hay tours al volcán desde Latacunga?", "¿Qué ruta tomar para el Cotopaxi?",
          "¿Se puede ir en transporte público?", "¿Cuánto tiempo se tarda desde el centro?", "¿Hay señalización en el camino?", "¿Necesito guía para entrar?", "¿Dónde alquilar equipo de montaña?"
        ],
        "responses": [
          "El Parque Nacional Cotopaxi está a 50 km al noreste de Latacunga. Toma la vía Latacunga-Machachi y sigue las señales. ¿Vas en auto o prefieres un tour organizado?",
          "¡Sí hay buses! Toma uno hacia Machachi y pide bajar en el desvío al Parque. Desde ahí, camina o contrata un pickup. ¿Necesitas horarios de transporte?",
          "En auto, son ~1h desde Latacunga. La entrada principal está en el sector El Pedregal. ¡No olvides tu abrigo! ¿Quieres saber sobre el clima actual?",
          "¿Sabías que hay un museo en el Parque? Está cerca de la laguna de Limpiopungo. ¡También verás venados y caballos salvajes!"],
          "Recomendación: contrata un guía en Latacunga (ofrecen tours desde $30). Incluyen transporte, equipo y seguro.  ¿Quieres que te pase contactos?"
        ]
      },
      {
        "tag": "ubicacion_parque_vicenteleon",
        "patterns": [
          "¿Dónde está el Parque Vicente León?", "Ubicación del parque central", "Cómo llegar al parque Vicente León", "¿Qué calles rodean el parque?", "¿Es seguro el parque de noche?",
          "¿Hay estacionamiento cerca?", "¿A qué distancia está de la Catedral?", "¿Qué buses paran ahí?", "¿El parque tiene wifi público?", "¿Horario de visita?"
        ],
        "responses": [
          " El Parque Vicente León es el corazón de Latacunga. Está entre las calles Maldonado, Quito, Echeverría y Sánchez de Orellana. ¡No te pierdas su reloj floral!",
          "Desde la Terminal Terrestre, toma un taxi ($1.25) o camina 15 minutos por la Av. Amazonas.  ",
          "¿Sabías que el parque tiene 4 glorietas? Cada una representa una época histórica.  ¡Perfecto para fotos al atardecer!",
          "De día es seguro, pero de noche cierran sus accesos.  ¿Quieres saber sobre eventos culturales que se realizan allí?",
          "Alrededor hay cafeterías, la Gobernación y la Iglesia de San Francisco.  ¿Te interesa la arquitectura colonial? ¡Te encantará!"
        ]
      },
      {
        "tag": "ubicacion_hospitalgeneral",
        "patterns": [
          "¿Dónde queda el hospital general?", "Dirección del hospital de Latacunga", "Ubicación del centro médico principal", "¿Cómo llegar al hospital desde el centro?", "¿Hay farmacias 24/7 cerca del hospital?",
          "¿El hospital tiene servicio de ambulancia?", "¿Cuál es el teléfono de emergencias?", "¿Hay especialistas en el hospital?", "¿Se necesita cita previa?", "¿Aceptan seguros internacionales?"
        ],
        "responses": [
          " El Hospital General está en la Av. Unidad Nacional, junto al Colegio Vicente León. Si vas en taxi, di «al hospital de la UNA» (todos lo conocen).",
          "Emergencias: 098 765 4321.  Si vienes del centro, toma la Av. Amazonas hacia el sur y gira en la segunda rotonda. ¿Necesitas acompañamiento?",
          "Frente al hospital hay una farmacia 24 horas.  ¿Buscas una especialidad médica en particular? Puedo ayudarte con contactos.",
          "¿Sabías que el hospital tiene un helipuerto para emergencias graves?  ¡Es referencial para toda la provincia!",
          "Si vas en bus, las líneas 3, 7 y 12 paran a 2 cuadras. ¿Necesitas indicaciones más detalladas?"
        ]
      }
  ]
      {
        "tag": "ubicacion_iess",
        "patterns": [
          [
  
          ]
        ],
        "responses": [
          [
           
          ]
        ]
      },
      {
        "tag": "ubicacion_lalaguna",
        "patterns": [
          [
  
          ]
        ],
        "responses": [
          [
           
          ]
        ]
      },
      {
        "tag": "ubicacion_espe",
        "patterns": [
          [
  
          ]
        ],
        "responses": [
          [
           
          ]
        ]
      },
      {
        "tag": "ubicacion_utc",
        "patterns": [
          [
  
          ]
        ],
        "responses": [
          [
           
          ]
        ]
      },
      {
        "tag": "ubicacion_estadiolacocha",
        "patterns": [
          [
  
          ]
        ],
        "responses": [
          [
           
          ]
        ]
      },
      {
        "tag": "ubicacion_fae",
        "patterns": [
          [
  
          ]
        ],
        "responses": [
          [
           
          ]
        ]
      },
      {
        "tag": "ubicacion_aeropuerto",
        "patterns": [
          [
  
          ]
        ],
        "responses": [
          [
           
          ]
        ]
      }
    ]
  }
